insert into course (course_code, course_name)
values ('101', 'IT'),
       ('102', 'DV'),
       ('103', 'HR'),
       ('103', 'AI');

insert into student(student_name, student_recordbook)
VALUES ('Студент1', 'зачетка1'),
       ('Студент2', 'зачетка2'),
       ('Студент3', 'зачетка3'),
       ('Студент4', 'зачетка4'),
       ('Студент5', 'зачетка5'),
       ('Студент6', 'зачетка6'),
       ('Студент7', 'зачетка7'),
       ('Студент8', 'зачетка8'),
       ('Студент9', 'зачетка9'),
       ('Студент10', 'зачетка10');